; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v8 ?v6)
		(pred_5 ?v7)
		(pred_1 ?v2)
		(pred_6 ?v2)
		(pred_3 ?v7 ?v2)
		(pred_4)
		(pred_2 ?v7))

   (:action op_1
       :parameters  (?v5 ?v1)
       :precondition (and (not-eq ?v5 ?v1) 
                          (pred_1 ?v5) (pred_1 ?v1) (pred_6 ?v5))
       :effect (and  (pred_6 ?v1)
		     (not (pred_6 ?v5))))


   (:action op_3
       :parameters (?v4 ?v3)
       :precondition  (and  (pred_5 ?v4) (pred_1 ?v3)
			    (pred_3 ?v4 ?v3) (pred_6 ?v3) (pred_4))
       :effect (and (pred_2 ?v4)
		    (not (pred_3 ?v4 ?v3)) 
		    (not (pred_4))))

   (:action op_2
       :parameters  (?v4  ?v3)
       :precondition  (and  (pred_5 ?v4) (pred_1 ?v3)
			    (pred_2 ?v4) (pred_6 ?v3))
       :effect (and (pred_3 ?v4 ?v3)
		    (pred_4)
		    (not (pred_2 ?v4)))))

; problem
(define (problem ferry-l5-c3)
(:domain ferry)
(:objects obj_01 obj_03 obj_08 obj_04 obj_07 
          obj_02 obj_05 obj_06 
)
(:init
(pred_1 obj_01)
(pred_1 obj_03)
(pred_1 obj_08)
(pred_1 obj_04)
(pred_1 obj_07)
(pred_5 obj_02)
(pred_5 obj_05)
(pred_5 obj_06)
(not-eq obj_01 obj_03)
(not-eq obj_03 obj_01)
(not-eq obj_01 obj_08)
(not-eq obj_08 obj_01)
(not-eq obj_01 obj_04)
(not-eq obj_04 obj_01)
(not-eq obj_01 obj_07)
(not-eq obj_07 obj_01)
(not-eq obj_03 obj_08)
(not-eq obj_08 obj_03)
(not-eq obj_03 obj_04)
(not-eq obj_04 obj_03)
(not-eq obj_03 obj_07)
(not-eq obj_07 obj_03)
(not-eq obj_08 obj_04)
(not-eq obj_04 obj_08)
(not-eq obj_08 obj_07)
(not-eq obj_07 obj_08)
(not-eq obj_04 obj_07)
(not-eq obj_07 obj_04)
(pred_4)
(pred_3 obj_02 obj_03)
(pred_3 obj_05 obj_04)
(pred_3 obj_06 obj_01)
(pred_6 obj_04)
)
(:goal
(and
(pred_3 obj_02 obj_01)
(pred_3 obj_05 obj_03)
(pred_3 obj_06 obj_03)
)
)

(:constraints
  (and
    (sometime-before  (pred_3 obj_02 obj_01) (pred_6 obj_08))
    (sometime-before  (pred_3 obj_05 obj_03) (pred_6 obj_01))
    (sometime-before  (pred_3 obj_06 obj_03) (pred_6 obj_08))
  )
)
)

; plan
1. (op_3 obj_05 obj_04)
   deleted: (pred_3 obj_05 obj_04) (pred_4)
   added: (pred_2 obj_05)
   goals met: 0 of 3
2. (op_1 obj_04 obj_08)
   deleted: (pred_6 obj_04)
   added: (pred_6 obj_08)
   goals met: 0 of 3
3. (op_2 obj_05 obj_08)
   deleted: (pred_2 obj_05)
   added: (pred_3 obj_05 obj_08) (pred_4)
   goals met: 0 of 3
4. (op_1 obj_08 obj_03)
   deleted: (pred_6 obj_08)
   added: (pred_6 obj_03)
   goals met: 0 of 3
5. (op_3 obj_02 obj_03)
   deleted: (pred_3 obj_02 obj_03) (pred_4)
   added: (pred_2 obj_02)
   goals met: 0 of 3
6. (op_1 obj_03 obj_01)
   deleted: (pred_6 obj_03)
   added: (pred_6 obj_01)
   goals met: 0 of 3
7. (op_2 obj_02 obj_01)
   deleted: (pred_2 obj_02)
   added: (pred_3 obj_02 obj_01) (pred_4)
   goals met: 1 of 3
8. (op_3 obj_06 obj_01)
   deleted: (pred_3 obj_06 obj_01) (pred_4)
   added: (pred_2 obj_06)
   goals met: 1 of 3
9. (op_1 obj_01 obj_03)
   deleted: (pred_6 obj_01)
   added: (pred_6 obj_03)
   goals met: 1 of 3
10. (op_2 obj_06 obj_03)
   deleted: (pred_2 obj_06)
   added: (pred_3 obj_06 obj_03) (pred_4)
   goals met: 2 of 3
11. (op_1 obj_03 obj_08)
   deleted: (pred_6 obj_03)
   added: (pred_6 obj_08)
   goals met: 2 of 3
12. (op_3 obj_05 obj_08)
   deleted: (pred_3 obj_05 obj_08) (pred_4)
   added: (pred_2 obj_05)
   goals met: 2 of 3
13. (op_1 obj_08 obj_03)
   deleted: (pred_6 obj_08)
   added: (pred_6 obj_03)
   goals met: 2 of 3
14. (op_2 obj_05 obj_03)
   deleted: (pred_2 obj_05)
   added: (pred_3 obj_05 obj_03) (pred_4)
   goals met: 3 of 3
